app/views/home/index.html.erb

SELECT `campaigns`.* FROM `campaigns`  WHERE `campaigns`.`user_id` = 1
---
  <%= link_to "New Campaign", new_campaign_path %><br><br>
  <% @current_user.campaigns.each do |campaign| %>