app/controllers/campaign_controller.rb

INSERT INTO `campaigns` (`created_at`, `title`, `updated_at`, `user_id`) VALUES ('2014-07-07 01:15:20', 'badafg', '2014-07-07 01:15:20', 1)
---
  def create
    @campaign = Campaign.create({title: params[:title], user_id: @current_user.id})

UPDATE `campaigns` SET `title` = 'badafg AGAIN', `updated_at` = '2014-07-07 02:47:03' WHERE `campaigns`.`id` = 1
---
  def update
    case params[:commit]
    when "Apply Changes"
      @campaign.update_data(params[:campaign][:title], params[:user_email])