app/controllers/home_controller.rb

  def index
    @top_campaigns = Campaign.limit(5)
---
SELECT  `campaigns`.* FROM `campaigns`  LIMIT 5